АлогистикТест2/src/Documents/алк_СборкаЗапасов/алк_СборкаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_СборкаЗапасов</name>
  <registerRecords>AccumulationRegister.алк_ВыпускПродукцииСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_МатериалыЗатратыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииГОСТ</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_Отходы</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыпускОтходы</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПиломатериалыПереданныеНаСушку</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаЗапасов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаЗапасов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПродукции</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПродукции</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийСборкаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинусЗапасы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.алк_ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоРазделитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаГОСТ</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоГОСТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемГОСТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомераПродукция</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_НаправленияДеятельности/алк_НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_НаправленияДеятельности</name>
  <enumValues>
    <name>ДревесныеГранулы</name>
  </enumValues>
  <enumValues>
    <name>Лесопиление</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
  <enumValues>
    <name>МалоеЛесопиление</name>
  </enumValues>
  <enumValues>
    <name>Шпон</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/алк_ВидыОбъектов/алк_ВидыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ВидыОбъектов</name>
  <predefined>
    <items>
      <name>БуферныйСкладЦЛП</name>
      <description>Буферный склад ЦЛП</description>
    </items>
    <items>
      <name>СГП</name>
      <description>СГП</description>
    </items>
    <items>
      <name>УчастокЛущенияЦПШ</name>
      <description>Участок лущения ЦПШ</description>
    </items>
    <items>
      <name>УчастокПереупаковкиСГП</name>
      <description>Участок переупаковки СГП</description>
    </items>
    <items>
      <name>УчастокСборкиОтходов</name>
      <description>Участок сборки отходов</description>
    </items>
    <items>
      <name>УчастокСортированныхЛМ</name>
      <description>Участок сортированных лесоматериалов</description>
    </items>
    <items>
      <name>ЦехПроизводстваПМ</name>
      <description>Цех производства ПМ</description>
    </items>
  </predefined>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/КатегорииНоменклатуры/КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>&lt;Без категории></description>
    </items>
    <items>
      <name>Карандаши</name>
      <description>Карандаши</description>
    </items>
    <items>
      <name>Кора</name>
      <description>Кора</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Опилки</name>
      <description>Опилки</description>
    </items>
    <items>
      <name>ОтходыПилмат</name>
      <description>Отходы производства пиломатериалов</description>
    </items>
    <items>
      <name>Пиловочник</name>
      <description>Пиловочник</description>
    </items>
    <items>
      <name>Пиломатериал</name>
      <description>Пиломатериал</description>
    </items>
    <items>
      <name>ПиломатериалСП</name>
      <description>Пиломатериал (СП)</description>
    </items>
    <items>
      <name>Шпон</name>
      <description>Шпон</description>
    </items>
    <items>
      <name>ШпонКусковой</name>
      <description>Шпон кусковой</description>
    </items>
    <items>
      <name>Щепа</name>
      <description>Щепа</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПоКлассификатору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристики</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_СборкаЗапасов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	// Серийные номера
	ИспользоватьСерийныеНомераОстатки = РаботаССерийнымиНомерами.ИспользоватьСерийныеНомераОстатки();
	
	Если Объект.Направление = Перечисления.алк_НаправленияДеятельности.Лесопиление Тогда
		
		ТолькоПросмотр = Не РольДоступна("алк_Администратор") И Объект.Автозаполнение;	
		
	КонецЕсли; 
	
	
	ФлагДоступности = РольДоступна("алк_Администратор") 
			Или РольДоступна("ПолныеПрава")	
			Или РольДоступна("алк_ДобавлениеИзменениеПодсистемыДревесныеГранулы");

	Элементы.ВидОперации.Доступность = ФлагДоступности;
	Элементы.Организация.Доступность = ФлагДоступности;
	Элементы.Направление.Доступность = ФлагДоступности;	
	Элементы.СтруктурнаяЕдиница.Доступность                = ФлагДоступности;
	Элементы.СтруктурнаяЕдиницаПродукцииСборка.Доступность = ФлагДоступности;
	Элементы.ЯчейкаПродукцииСборка.Доступность             = ФлагДоступности;
	Элементы.СтруктурнаяЕдиницаЗапасовСборка.Доступность   = ФлагДоступности;
	
	Элементы.ПродукцияСерийныеНомера.Доступность = ФлагДоступности;
	
	Если Параметры.Ключ.Пустая() Тогда 		
		ЗаполнитьРеквизитыПоНаправлению();		
	КонецЕсли; 	 
	
	УчастокПриИзмененииНаСервере();
			
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	УстановитьДоступностьПоАвтозаполнению();
	УстановитьВидимостьКнопокЗаполнения();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКнопокЗаполнения()  
	
	Если Объект.Направление = ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.МалоеЛесопиление") Тогда  
		
		Элементы.ЗаполнитьОтходы.Видимость = Истина;
	
	Иначе
		
		Элементы.ЗаполнитьОтходы.Видимость = Ложь;
	
	КонецЕсли;     
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПодборПроизведен" 
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		//АдресЗапасовВХранилище	= Параметр;
		//
		//Если МаркерПодбора = "Продукция" Тогда
		//	
		//	ИмяТабличнойЧасти = "Продукция";
		//	
		//ИначеЕсли МаркерПодбора = "Запасы" Тогда
		//	
		//	ИмяТабличнойЧасти = "Запасы";
		//	
		//ИначеЕсли МаркерПодбора = "Отходы" Тогда
		//	
		//	ИмяТабличнойЧасти = "Отходы";
		//	
		//КонецЕсли;
		//
		//ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, Истина, Истина);
		
	ИначеЕсли ИмяСобытия = "ПодборСерий"
		И ЗначениеЗаполнено(Параметр) 
		//Проверка на владельца формы
		И Источник <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")
		И Источник = УникальныйИдентификатор
		Тогда
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.ТЧПродукция Тогда
			ПолучитьСерийныеНомераПродукцииИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		Иначе
			ПолучитьСерийныеНомераЗапасыИзХранилища(Параметр.АдресВоВременномХранилище, Параметр.КлючСтроки);
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СобытияЭлементовФормы


#Область ОбработчикиСобытийЭлементовТаблицыФормыПродукция

&НаКлиенте
Процедура ПродукцияПередУдалением(Элемент, Отказ)
	
	// Серийные номера
	Для каждого ВыделеннаяСтрока Из Элементы.Продукция.ВыделенныеСтроки Цикл
		ТекущиеДанныеСтроки = Элементы.Продукция.ДанныеСтроки(ВыделеннаяСтрока);
		РаботаССерийнымиНомерамиКлиентСервер.УдалитьСерийныеНомераПоКлючуСвязи(Объект.СерийныеНомераПродукция, ТекущиеДанныеСтроки,,ИспользоватьСерийныеНомераОстатки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.КлючСвязи = 0;
		Элемент.ТекущиеДанные.СерийныеНомера = "";
	КонецЕсли;	
	
	Если Элемент.ТекущийЭлемент.Имя = "ПродукцияСерийныеНомера" Тогда
		ОткрытьПодборСерийныеНомера("Продукция","СерийныеНомераПродукция");
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#КонецОбласти 


#Область РаботаССерийнымиНомерами

&НаКлиенте
Процедура ОткрытьПодборСерийныеНомера(ИмяТЧЗапасы, ИмяТЧСерийныеНомера)
	
	ТекущиеДанныеИдентификатор = Элементы[ИмяТЧЗапасы].ТекущиеДанные.ПолучитьИдентификатор();
	ПараметрыСерийныхНомеров = ПараметрыПодбораСерийныхНомеров(ТекущиеДанныеИдентификатор, ИмяТЧЗапасы, ИмяТЧСерийныеНомера);
	// Для подбора СН используем поле СтруктурнаяЕдиницаЗапасов
	ПараметрыСерийныхНомеров.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиницаЗапасов);
	ПараметрыСерийныхНомеров.Вставить("Ячейка", Объект.ЯчейкаЗапасов);
	ОткрытьФорму("Обработка.ПодборСерийныхНомеров.Форма", ПараметрыСерийныхНомеров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСерийныеНомераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерийныеНомера("Продукция","СерийныеНомераПродукция");
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПодбораСерийныхНомеров(ТекущиеДанныеИдентификатор, ИмяТЧ, ИмяТЧСерийныеНомера)
	
	Если ИмяТЧ = "Запасы" И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСборкаЗапасов.Сборка") Тогда
		РежимПодбора = Истина;
	ИначеЕсли ИмяТЧ = "Продукция" И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСборкаЗапасов.Разборка") Тогда
		РежимПодбора = Истина;
	Иначе
		РежимПодбора = Ложь;
	КонецЕсли;
	
	Возврат РаботаСФормойДокумента.ПараметрыПодбораСерийныхНомеров(Объект, ЭтотОбъект.УникальныйИдентификатор, ТекущиеДанныеИдентификатор, РежимПодбора, ИмяТЧ, ИмяТЧСерийныеНомера);
	
КонецФункции

&НаСервере
Функция ПолучитьСерийныеНомераЗапасыИзХранилища(АдресВоВременномХранилище, КлючСтроки)
	
	ПараметрыИменаПолей = Новый Структура;
	ПараметрыИменаПолей.Вставить("ИмяТЧЗапасы", "Запасы");
	ПараметрыИменаПолей.Вставить("ИмяТЧСерийныеНомера", "СерийныеНомера");
	
	Возврат РаботаСФормойДокумента.ПолучитьСерийныеНомераИзХранилища(Объект, АдресВоВременномХранилище, КлючСтроки, ПараметрыИменаПолей);
	
КонецФункции

&НаСервере
Функция ПолучитьСерийныеНомераПродукцииИзХранилища(АдресВоВременномХранилище, КлючСтроки)
	
	ПараметрыИменаПолей = Новый Структура;
	ПараметрыИменаПолей.Вставить("ИмяТЧЗапасы", "Продукция");
	ПараметрыИменаПолей.Вставить("ИмяТЧСерийныеНомера", "СерийныеНомераПродукция");
	
	Возврат РаботаСФормойДокумента.ПолучитьСерийныеНомераИзХранилища(Объект, АдресВоВременномХранилище, КлючСтроки, ПараметрыИменаПолей);
	
КонецФункции


#КонецОбласти


&НаКлиенте
Процедура УстановитьДоступностьПоАвтозаполнению()
	
	//Если Объект.Автозаполнение И Объект.Продукция.Количество() <> 0 Тогда
	//	
	//	ТекстВопроса = НСтр("ru = 'Документ предполагает заполнение по ""Оперативным данным"", 
	//	|табличная часть будет очищена.
	//	|Продолжить выполнение операции?'");
	//	
	//	ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьПродукциюЗавершение", ЭтотОбъект);
	//	
	//	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	//	
	//КонецЕсли;  	    
	
	Если Объект.Автозаполнение Тогда
		
		Элементы.Продукция.ТолькоПросмотр = Истина;
		Элементы.ПродукцияЗаполнитьПоОперативнымДанным.Видимость = Истина;
		
		Если Объект.Направление =  ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.МалоеЛесопиление") Тогда 	
			Элементы.Продукция.ТолькоПросмотр = Ложь; 	
		КонецЕсли;
		
	Иначе
		
		Элементы.Продукция.ТолькоПросмотр = Ложь;
		Элементы.ПродукцияЗаполнитьПоОперативнымДанным.Видимость = Ложь;

		Если Объект.Направление =  ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.МалоеЛесопиление") ИЛИ Объект.Участок = ПолучитьУчастокМалойПересортировки()  Тогда 	
			Элементы.ПродукцияЗаполнитьПоОперативнымДанным.Видимость = Истина;     		
		Иначе 		
			Элементы.ПродукцияЗаполнитьПоОперативнымДанным.Видимость = Ложь;	
		КонецЕсли;	
				
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
		
КонецПроцедуры   

&НаСервере
Процедура РасчитатьОтходы() 
	
	Если Объект.Направление = Перечисления.алк_НаправленияДеятельности.МалоеЛесопиление Тогда  
		
		ПроцентОпилок = 15;
		ПроцентГорбыля = 39;		
		
		// отходы МЛП
	
		// Учет отходов будет настроен следующим образом:
		// во вкладке Отходы нужно будет учитывать опилки и горбыль, чтобы они считались автоматически от поданного сырья, указанного во вкладке Материалы.
		// Горбыль в количестве 39% от поданного, м3
		// Опилки 15 % от поданного сырья, м3

		ОбъемМатериала = Объект.Запасы.Итог("Объем");		
				
		Горбыль	= ПроцентГорбыля*ОбъемМатериала/100;
		Опилки	= ПроцентОпилок*ОбъемМатериала/100;  	
		
		Объект.Отходы.Очистить();
		
		НоваяСтрокаОтходы = Объект.Отходы.Добавить();
		НоваяСтрокаОтходы.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000024"); // Горбыль 
		НоваяСтрокаОтходы.Объем = Горбыль;
		
		НоваяСтрокаОтходы = Объект.Отходы.Добавить();
		НоваяСтрокаОтходы.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000009"); // Опилки
	    НоваяСтрокаОтходы.Объем = Опилки;
		
	КонецЕсли;
	
	Сообщить("Выполнено заполнение отходов.");	

КонецПроцедуры   




&НаКлиенте
Процедура ЗапасыХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
	//	
	//	Дата = РфпСервер.ПериодПроведения(ЭтотОбъект.Ссылка);
	//	
	//КонецЕсли;
	
	Дата = РфпСервер.ПериодПроведения(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОперативнымДанным(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Направление) ИЛИ Не ЗначениеЗаполнено(Объект.Участок) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Направление) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Укажите направление деятельности!";
			Сообщение.Сообщить(); 
			
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Объект.Участок) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Заполните участок!";
			Сообщение.Сообщить(); 
			
		КонецЕсли;
				
		Возврат;
		
	КонецЕсли;
	
	
	ТекстВопроса = НСтр("ru = 'Документ будет полностью перезаполнен по ""Оперативным данным"", 
	|табличная часть будет очищена.
	|Продолжить выполнение операции?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоОперативнымЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьАктуальнуюВерсиюДанных(Ссылка)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="ВЫБРАТЬ
	|	алк_СборкаЗапасов.ВерсияДанных
	|ИЗ
	|	Документ.алк_СборкаЗапасов КАК алк_СборкаЗапасов
	|ГДЕ
	|	алк_СборкаЗапасов.Ссылка = &Ссылка";  
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	ВерсияДанныхВБД = Запрос.Выполнить().Выгрузить();
	
	Возврат ВерсияДанныхВБД[0].ВерсияДанных; 
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоОперативнымЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Да Тогда
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
			Если Объект.ВерсияДанных <> ПолучитьАктуальнуюВерсиюДанных(Объект.Ссылка) Тогда 
				Сообщить("Данный документ был отредактирован другим пользователем, перезайдите!"); 
				Возврат;
			КонецЕсли;
		КонецЕсли;
						
		ЗаполнитьПоДаннымРегистра(); 		
		ОбновитьОтображениеДанных(Элементы.Продукция);
		
		Модифицированность = Истина;
						
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПродукциюЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Да Тогда
		
		Объект.Продукция.Очистить();
		Объект.СерийныеНомераПродукция.Очистить();
		
		Элементы.Продукция.ТолькоПросмотр = Истина;
		Элементы.ПродукцияЗаполнитьПоОперативнымДанным.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымРегистра()
	
	ОбъектДок = РеквизитФормыВЗначение("Объект");
	ОбъектДок.ЗаполнитьПродукциюПоДаннымРегистра();
	
	ЗначениеВРеквизитФормы(ОбъектДок.Продукция, "Объект.Продукция");	
	ЗначениеВРеквизитФормы(ОбъектДок.СерийныеНомераПродукция, "Объект.СерийныеНомераПродукция");
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыПоНаправлению();  
	
	УстановитьДоступностьПоАвтозаполнению();  
	
	УстановитьВидимостьКнопокЗаполнения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоНаправлению()
	
	Если Объект.Направление = ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.Лесопиление") Тогда
		
		Объект.СтруктурнаяЕдиница = РфпПолучениеДанныхСервер.ОбъектДанных(ПредопределенноеЗначение("Справочник.алк_ВидыОбъектов.ЦехПроизводстваПМ"));
		Объект.СтруктурнаяЕдиницаПродукции = РфпПолучениеДанныхСервер.ОбъектДанных(ПредопределенноеЗначение("Справочник.алк_ВидыОбъектов.БуферныйСкладЦЛП"));
		Объект.СтруктурнаяЕдиницаЗапасов = РфпПолучениеДанныхСервер.ОбъектДанных(ПредопределенноеЗначение("Справочник.алк_ВидыОбъектов.УчастокСортированныхЛМ"));
		
	КонецЕсли; 
	
	Если Объект.Направление =  Перечисления.алк_НаправленияДеятельности.МалоеЛесопиление Тогда
		
		УчастокМЛП = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000060"); // Участок МЛП
		
		Объект.СтруктурнаяЕдиница 			= УчастокМЛП;
		Объект.СтруктурнаяЕдиницаПродукции 	= УчастокМЛП; 
		Объект.СтруктурнаяЕдиницаЗапасов 	= УчастокМЛП;	
			
	КонецЕсли; 
		
	Если Объект.Направление = ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.Отходы") Тогда
		
		Объект.СтруктурнаяЕдиница = РфпПолучениеДанныхСервер.ОбъектДанных(ПредопределенноеЗначение("Справочник.алк_ВидыОбъектов.УчастокСборкиОтходов"));
		Объект.СтруктурнаяЕдиницаПродукции = РфпПолучениеДанныхСервер.ОбъектДанных(ПредопределенноеЗначение("Справочник.алк_ВидыОбъектов.УчастокСборкиОтходов"));
		
	КонецЕсли; 
	
	Если Объект.Направление = ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.ДревесныеГранулы") Тогда
		
		СкладыСтруктура = ПолучитьСкладыДГ(Объект.Дата);
		
		Объект.СтруктурнаяЕдиница = СкладыСтруктура.ДГ_Производство;
		Объект.СтруктурнаяЕдиницаПродукции = СкладыСтруктура.ДГ_Производство; 
		Объект.СтруктурнаяЕдиницаЗапасов = СкладыСтруктура.ДГ_Сырье;
		
	КонецЕсли;   	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСкладыДГ(ДатаСреза)  	
	Возврат РфпСервер.ПолучитьСкладыДГ(ДатаСреза);  
КонецФункции // ПолучитьСкладыДГ()
 
	


&НаКлиенте
Процедура АвтозаполнениеПриИзменении(Элемент)
	
	УстановитьДоступностьПоАвтозаполнению();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Сертификат) И ЗначениеЗаполнено(Объект.Сертификат) Тогда	
			СтрокаТабличнойЧасти.Сертификат = Объект.Сертификат;
	    КонецЕсли;
	КонецЕсли; 	
		
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные; 
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОграничениеПоВесу = 1250;  // вынес в переменную чтоб можно было обойти при отладке
	
	Если СтрокаТабличнойЧасти.Количество > ОграничениеПоВесу тогда  // простое условие чтоб не гонять на сервер, для больше части номенклатуры его достаточно
		
		МаксимальныйВесТары = ПолучитьМаксимальныйВесДляТары(СтрокаТабличнойЧасти.Характеристика);  	
		
		Если МаксимальныйВесТары < СтрокаТабличнойЧасти.Количество Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле  = "Элементы.Продукция.ТекущиеДанные.Количество";
			Сообщение.Текст = "Упаковка, с серийным номером "+СтрокаТабличнойЧасти.СерийныеНомера+" не может превышать " + МаксимальныйВесТары + " кг";
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;  
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Сертификат) Тогда
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(Объект.Сертификат) Тогда
		СтрокаТабличнойЧасти.Сертификат = Объект.Сертификат;
	КонецЕсли; 

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМаксимальныйВесДляТары(Характеристика) 
	
	Если Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048202") Тогда   // упаковка 0,65 т. 	
		Возврат 1250;	                                                                                             		
	ИначеЕсли Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048203") Тогда   // упаковка 1,00 т. 
	   	Возврат 1250;
	ИначеЕсли Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048629") Тогда   // упаковка 14,00 т. 
	   	Возврат 14250;	
	Иначе
		Возврат 60250;  // остается вагон хоппер	
	КонецЕсли; 
	
КонецФункции


&НаКлиенте
Процедура ОтходыПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Отходы.ТекущиеДанные; 
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Сертификат) И ЗначениеЗаполнено(Объект.Сертификат) Тогда
		СтрокаТабличнойЧасти.Сертификат = Объект.Сертификат;  		
	КонецЕсли;  
	
	Если СтрокаТабличнойЧасти.Ячейка = Неопределено Тогда  
		СтрокаТабличнойЧасти.Ячейка = ПредопределенноеЗначение("Справочник.Ячейки.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////

&НаКлиенте
Процедура ПродукцияКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;   	
	ПересчитатьОбъемСтрокиФакт(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОбъемСтрокиФакт(СтрокаТабличнойЧасти) Экспорт
	
	КатегорияНоменклатуры = РфпПолучениеДанныхСервер.КатегорияНоменклатурыНаСервере(СтрокаТабличнойЧасти.Номенклатура);
	
	Если КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиловочник") Тогда
		
		СтрокаТабличнойЧасти.Объем = РфпПолучениеДанныхСервер.ОбъемПоКубатурнику(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.Количество;	
		
	ИначеЕсли КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиломатериал") Тогда 
		
		СтрокаТабличнойЧасти.Объем = РфпПолучениеДанныхСервер.ОбъемПоХарактеристике(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.Количество;
		
	ИначеЕсли КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Окорка")  Тогда 
		
		СтрокаТабличнойЧасти.Объем = РфпПолучениеДанныхСервер.ОбъемПоКубатурнику(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.Количество;
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте 
Процедура ОбъемПриИзмененииНаСервере(СтрокаТабличнойЧасти)
	
	Если СтрокаТабличнойЧасти.Количество <> 0 Тогда 
		Возврат;
	КонецЕсли; 
	
	КатегорияНоменклатуры = РфпПолучениеДанныхСервер.КатегорияНоменклатурыНаСервере(СтрокаТабличнойЧасти.Номенклатура);
	
	Если КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиловочник") Тогда
		
		Объем = РфпПолучениеДанныхСервер.ОбъемПоКубатурнику(СтрокаТабличнойЧасти.Характеристика);		
		СтрокаТабличнойЧасти.Количество = Окр(?(Объем, СтрокаТабличнойЧасти.Объем/Объем, 0));	
		
	ИначеЕсли КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиломатериал") Тогда 
		
		Объем = РфпПолучениеДанныхСервер.ОбъемПоХарактеристике(СтрокаТабличнойЧасти.Характеристика);
		СтрокаТабличнойЧасти.Количество = Окр(?(Объем, СтрокаТабличнойЧасти.Объем/Объем, 0));
		
	ИначеЕсли КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Окорка")  Тогда 
		
		Объем = РфпПолучениеДанныхСервер.ОбъемПоКубатурнику(СтрокаТабличнойЧасти.Характеристика);
		СтрокаТабличнойЧасти.Количество = Окр(?(Объем, СтрокаТабличнойЧасти.Объем/Объем, 0));
		
	КонецЕсли;      	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбъемПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные; 
	ОбъемПриИзмененииНаСервере(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаСервере
Процедура ПодобратьПоОстаткамГОСТНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПоОстаткамГОСТ(Команда)
	ПодобратьПоОстаткамГОСТНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СерийныеНомераПродукцияПриИзменении(Элемент)
	
	УдалитьСтрокиПродукции();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПродукцию(Команда)
	
	УдалитьСтрокиПродукции();
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиПродукции()

	Ключи = Новый Массив;
	
	Для каждого СтрПакеты Из Объект.СерийныеНомераПродукция Цикл  	
		Ключи.Добавить(СтрПакеты.КлючСвязи);    
	КонецЦикла;	
	
	Всего = Объект.Продукция.Количество()-1;
	
	Для НС = -Всего По 0 Цикл 		
		Если Ключи.Найти(Объект.Продукция[-НС].КлючСвязи) = Неопределено Тогда  			
			Объект.Продукция.Удалить(-НС);		
		КонецЕсли;
	КонецЦикла; 	

КонецПроцедуры

#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры



// Конец СтандартныеПодсистемы.Печать

#КонецОбласти 

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	// т.к. лесобирда (двухсменка) передает по сменам Линии пеления (трехсменка) нужна возможность выбирать все смены. 
	//Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);  
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	
	//если малая пересортировка тогда заполняем склад
	Если Объект.Участок = ПолучитьУчастокМалойПересортировки() Тогда 
		Объект.СтруктурнаяЕдиницаПродукции = ПолучитьБуферныйСкладМалойПересортировки();
	КонецЕсли; 
	//\\ 
	
	УстановитьДоступностьПоАвтозаполнению();

	УчастокПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтходы(Команда)
	
	РасчитатьОтходы(); 
	Модифицированность = Истина;
	
	
КонецПроцедуры

///функции  для получения склада и участка ////////////////////////////////////////////////////////////////////////////////////////////////////
&НаСервереБезКонтекста
Функция ПолучитьУчастокМалойПересортировки()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_Участки.Ссылка
	|ИЗ
	|	Справочник.алк_Участки КАК алк_Участки
	|ГДЕ
	|	алк_Участки.Код = ""000000046""
	|	И НЕ алк_Участки.ЭтоГруппа"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.Ссылка; 
	КонецЦикла;
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьБуферныйСкладМалойПересортировки()   
	Возврат  Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000092");
КонецФункции
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
